---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.VelocityPressure
source: html/28fae159-7d16-2818-dac0-2a6185711711.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.VelocityPressure Property

The velocity pressure of the pipe. Units: (kg/(ft·s²))

## Syntax (C#)
```csharp
public double VelocityPressure { get; set; }
```